Revit 2020 API
UnitUtils.GetValidDisplayUnits Method (UnitType)
 Gets all valid display units for a given unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static IList<DisplayUnitType> GetValidDisplayUnits(
	UnitType unitType
)
Visual Basic
Public Shared Function GetValidDisplayUnits ( _
	unitType As UnitType _
) As IList(Of DisplayUnitType)
Visual C++
public:
static IList<DisplayUnitType>^ GetValidDisplayUnits(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type.
Return Value
 The valid display units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
GetValidDisplayUnits Overload
Autodesk.Revit.DB Namespace